app/controllers/custom_fields_controller.rb

SELECT `custom_fields`.* FROM `custom_fields`
---
  def index
    respond_to do |format|
      format.html {
        @custom_fields_by_type = CustomField.all.group_by {|f| f.class.name }