app/controllers/documents_controller.rb

  def index
    @sort_by = %w(category date title author).include?(params[:sort_by]) ? params[:sort_by] : 'category'
    documents = @project.documents.includes(:attachments, :category).to_a
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`project_id` = 1