app/controllers/files_controller.rb

SELECT  DISTINCT `projects`.`id` FROM `projects` LEFT OUTER JOIN `attachments` ON `attachments`.`container_id` = `projects`.`id` AND `attachments`.`container_type` = 'Project' WHERE `projects`.`id` = 1  ORDER BY attachments.filename ASC LIMIT 1
---
  def index
    sort_init 'filename', 'asc'
    sort_update 'filename' => "#{Attachment.table_name}.filename",
                'created_on' => "#{Attachment.table_name}.created_on",
                'size' => "#{Attachment.table_name}.filesize",
                'downloads' => "#{Attachment.table_name}.downloads"

    @containers = [Project.includes(:attachments).
                     references(:attachments).reorder(sort_clause).find(@project.id)]