app/controllers/issues_controller.rb

SELECT `users`.id FROM `users` INNER JOIN `groups_users` ON `users`.`id` = `groups_users`.`group_id` WHERE `users`.`type` IN ('Group', 'GroupBuiltin', 'GroupAnonymous', 'GroupNonMember') AND `groups_users`.`user_id` = 5
SELECT COUNT(*) FROM `projects` WHERE (projects.status = 1 AND projects.id IN (SELECT em.project_id FROM enabled_modules em WHERE em.name='issue_tracking'))
SELECT `projects`.* FROM `projects` WHERE ((projects.status = 1 AND projects.id IN (SELECT em.project_id FROM enabled_modules em WHERE em.name='issue_tracking')) OR projects.id = 1)
SELECT  `repositories`.* FROM `repositories` WHERE `repositories`.`project_id` = 1 AND (is_default = 1) LIMIT 1
SELECT `changesets`.* FROM `changesets` INNER JOIN `repositories` ON `repositories`.`id` = `changesets`.`repository_id` INNER JOIN `projects` ON `projects`.`id` = `repositories`.`project_id` INNER JOIN `changesets_issues` ON `changesets`.`id` = `changesets_issues`.`changeset_id` WHERE `changesets_issues`.`issue_id` = 2 AND (projects.status <> 9 AND projects.id IN (SELECT em.project_id FROM enabled_modules em WHERE em.name='repository'))  ORDER BY changesets.committed_on ASC, changesets.id ASC
---
  def show
    @journals = @issue.journals.includes(:user, :details).
                    references(:user, :details).
                    reorder(:created_on, :id).to_a
    @journals.each_with_index {|j,i| j.indice = i+1}
    @journals.reject!(&:private_notes?) unless User.current.allowed_to?(:view_private_notes, @issue.project)
    Journal.preload_journals_details_custom_fields(@journals)
    @journals.select! {|journal| journal.notes? || journal.visible_details.any?}
    @journals.reverse! if User.current.wants_comments_in_reverse_order?

    @changesets = @issue.changesets.visible.preload(:repository, :user).to_a

INSERT INTO `issues` (`project_id`, `author_id`, `start_date`, `tracker_id`, `status_id`, `subject`, `description`, `priority_id`, `sprint_id`, `updated_on`, `created_on`, `position`, `lock_version`) VALUES (1, 5, '2016-02-18', 1, 2, 'Test project', '', 2, 2, '2016-02-18 09:43:13', '2016-02-18 09:43:13', 5, 0)
UPDATE `issues` SET `issues`.`root_id` = 7, `issues`.`lft` = 1, `issues`.`rgt` = 2 WHERE `issues`.`id` = 7
---
  def create
    unless User.current.allowed_to?(:add_issues, @issue.project, :global => true)
      raise ::Unauthorized
    end
    call_hook(:controller_issues_new_before_save, { :params => params, :issue => @issue })
    @issue.save_attachments(params[:attachments] || (params[:issue] && params[:issue][:uploads]))

UPDATE `issues` SET `issues`.`status_id` = 5, `issues`.`start_date` = '2016-02-18', `issues`.`due_date` = '2016-02-18', `issues`.`estimated_hours` = 3.0, `issues`.`done_ratio` = 100, `issues`.`updated_on` = '2016-02-18 08:48:38', `issues`.`closed_on` = '2016-02-18 08:48:38', `issues`.`lock_version` = 4 WHERE `issues`.`id` = 1 AND `issues`.`lock_version` = 3
---
  def update
    return unless update_issue_from_params
    @issue.save_attachments(params[:attachments] || (params[:issue] && params[:issue][:uploads]))