app/controllers/projects_controller.rb

  def create
    @issue_custom_fields = IssueCustomField.sorted.to_a
    @trackers = Tracker.sorted.to_a
    @project = Project.new
    @project.safe_attributes = params[:project]

    if @project.save
---
INSERT INTO `projects` (`name`, `description`, `identifier`, `created_on`, `updated_on`, `lft`, `rgt`) VALUES ('idbyme', '', 'idbyme_project', '2016-02-17 09:06:23', '2016-02-17 09:06:23', 1, 2)

  def show
    # try to redirect to the requested menu item
    if params[:jump] && redirect_to_project_menu_item(@project, params[:jump])
      return
    end

    @users_by_role = @project.users_by_role
    @subprojects = @project.children.visible.to_a
    @news = @project.news.limit(5).includes(:author, :project).reorder("#{News.table_name}.created_on DESC").to_a
---
SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('AnonymousUser')  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `roles`.* FROM `roles`
SELECT  `news`.* FROM `news` WHERE `news`.`project_id` = 1  ORDER BY news.created_on DESC LIMIT 5
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` IN (3)