app/controllers/settings_controller.rb

SELECT  `settings`.* FROM `settings` WHERE `settings`.`name` = 'ui_theme'  ORDER BY `settings`.`id` DESC LIMIT 1
---
  def edit
    @notifiables = Redmine::Notifiable.all
    if request.post? && params[:settings] && params[:settings].is_a?(Hash)
      settings = (params[:settings] || {}).dup.symbolize_keys
      settings.each do |name, value|