app/controllers/trackers_controller.rb

  def edit
    @tracker ||= Tracker.find(params[:id])
    @projects = Project.all
---
SELECT  `trackers`.* FROM `trackers` WHERE `trackers`.`id` = 1 LIMIT 1
SELECT `projects`.* FROM `projects`