app/controllers/users_controller.rb

SELECT `auth_sources`.* FROM `auth_sources`
---
  def new
    @user = User.new(:language => Setting.default_language, :mail_notification => Setting.default_notification_option)
    @user.safe_attributes = params[:user]
    @auth_sources = AuthSource.all

INSERT INTO `users` (`type`, `language`, `mail_notification`, `firstname`, `lastname`, `admin`, `login`, `salt`, `hashed_password`, `passwd_changed_on`, `created_on`, `updated_on`) VALUES ('User', 'en', 'only_my_events', 'Bunna', 'KAL', 1, 'bunnakal', '2fb6d7de08db09a457561d5ee19e4c24', 'd2cd886df43063c8e326260e1508548d88595e99', '2016-02-17 10:19:35', '2016-02-17 10:19:35', '2016-02-17 10:19:35')
---
  def create
    @user = User.new(:language => Setting.default_language, :mail_notification => Setting.default_notification_option)
    @user.safe_attributes = params[:user]
    @user.admin = params[:user][:admin] || false
    @user.login = params[:user][:login]
    @user.password, @user.password_confirmation = params[:user][:password], params[:user][:password_confirmation] unless @user.auth_source_id
    @user.pref.attributes = params[:pref] if params[:pref]

    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('Group', 'GroupBuiltin', 'GroupAnonymous', 'GroupNonMember')
---
  def find_user
    if params[:id] == 'current'
      require_login || return
      @user = User.current
    else
      @user = User.find(params[:id])