app/controllers/welcome_controller.rb

  def index
    @news = News.latest User.current
---
SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = 5 LIMIT 1