app/controllers/wiki_controller.rb

SELECT  `wiki_pages`.* FROM `wiki_pages` WHERE `wiki_pages`.`wiki_id` = 1 AND (LOWER(title) = LOWER('Wiki'))  ORDER BY title LIMIT 1
---
  def find_existing_or_new_page
    @page = @wiki.find_or_new_page(params[:id])